---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSettings.SizeSuffix
source: html/02fb081a-ba3a-af12-13d7-2b5ef6e8fb69.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings.SizeSuffix Property

The conduit size suffix string.

## Syntax (C#)
```csharp
public string SizeSuffix { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null